#pragma once
#include<ntifs.h>
#include<ntddk.h>
#include <ntimage.h>
#include <intrin.h>
#include <aux_klib.h>
#pragma comment(lib, "aux_klib.lib")
#include<wdm.h>

#define getEndOffset(end , buffer ) end - sizeof(buffer) + 1
typedef ULONG  DWORD;
typedef USHORT  WORD;
typedef PUCHAR BYTE;




// inline hooking : http://www.rohitab.com/discuss/topic/40590-header-file-for-windows-user-mode-and-kernel-mode-inline-hooking/
// page fault hookinh : https://www.digitalwhisper.co.il/files/Zines/0x16/DW22-2-PageFaultHooking.pdf
// sddt hookinh : https://rayanfam.com/topics/hypervisor-from-scratch-part-8/
// idt hookinh : 
// irp hooking : https://www.digitalwhisper.co.il/files/Zines/0x07/DW7-2-Rootkits_Part2.pdf
// fs hookinh : 
// gdt hooking : 
// ldt hookinh : 
// pte hooking : 
// sysenter hooking : 


/*
	TO READ :
		https://blackhat.com/presentations/bh-usa-06/BH-US-06-Tereshkin.pdf
		https://www.digitalwhisper.co.il/files/Zines/0x78/DigitalWhisper120.pdf


*/


extern "C" {
	UCHAR* PsGetProcessImageFileName(IN PEPROCESS Process);
	PVOID RtlPcToFileHeader(PVOID PcValue, PVOID* BaseOfImage); // it is better to check with : MmGetSystemRoutineAddress and to get from there the address ... but I am lazy bustered . 
	//lkd> x nt!NtQuerySystemInformation
	//fffff800`59495a10 nt!NtQuerySystemInformation(void)
	NTSTATUS ZwQuerySystemInformation(int SystemInformationClass, PVOID SystemInformation, ULONG SystemInformationLength, PULONG ReturnLength);
	//ZwQuerySystemInformation
	NTKERNELAPI PIMAGE_NT_HEADERS NTAPI RtlImageNtHeader(_In_ PVOID Base);
	NTSTATUS ZwProtectVirtualMemory(IN HANDLE ProcessHandle, IN PVOID* BaseAddress, IN SIZE_T* NumberOfBytesToProtect, IN ULONG NewAccessProtection, OUT PULONG OldAccessProtection);
}

//lkd> x nt!ZwQuerySystemInformation
//fffff800`5921a1d0 nt!ZwQuerySystemInformation(ZwQuerySystemInformation)
typedef struct _SYSTEM_THREAD_INFORMATION
{
	LARGE_INTEGER KernelTime;
	LARGE_INTEGER UserTime;
	LARGE_INTEGER CreateTime;
	ULONG WaitTime;
	PVOID StartAddress;
	CLIENT_ID ClientId;
	KPRIORITY Priority;
	LONG BasePriority;
	ULONG ContextSwitches;
	ULONG ThreadState;
	KWAIT_REASON WaitReason;
}SYSTEM_THREAD_INFORMATION, * PSYSTEM_THREAD_INFORMATION;

typedef struct _SYSTEM_PROCESS_INFO
{
	ULONG NextEntryOffset;
	ULONG NumberOfThreads;
	LARGE_INTEGER WorkingSetPrivateSize;
	ULONG HardFaultCount;
	ULONG NumberOfThreadsHighWatermark;
	ULONGLONG CycleTime;
	LARGE_INTEGER CreateTime;
	LARGE_INTEGER UserTime;
	LARGE_INTEGER KernelTime;
	UNICODE_STRING ImageName;
	KPRIORITY BasePriority;
	HANDLE UniqueProcessId;
	HANDLE InheritedFromUniqueProcessId;
	ULONG HandleCount;
	ULONG SessionId;
	ULONG_PTR UniqueProcessKey;
	SIZE_T PeakVirtualSize;
	SIZE_T VirtualSize;
	ULONG PageFaultCount;
	SIZE_T PeakWorkingSetSize;
	SIZE_T WorkingSetSize;
	SIZE_T QuotaPeakPagedPoolUsage;
	SIZE_T QuotaPagedPoolUsage;
	SIZE_T QuotaPeakNonPagedPoolUsage;
	SIZE_T QuotaNonPagedPoolUsage;
	SIZE_T PagefileUsage;
	SIZE_T PeakPagefileUsage;
	SIZE_T PrivatePageCount;
	LARGE_INTEGER ReadOperationCount;
	LARGE_INTEGER WriteOperationCount;
	LARGE_INTEGER OtherOperationCount;
	LARGE_INTEGER ReadTransferCount;
	LARGE_INTEGER WriteTransferCount;
	LARGE_INTEGER OtherTransferCount;
	SYSTEM_THREAD_INFORMATION Threads[1];
}SYSTEM_PROCESS_INFO, * PSYSTEM_PROCESS_INFO;

typedef struct _LDR_DATA_TABLE_ENTRY {
	LIST_ENTRY InLoadOrderLinks;
	LIST_ENTRY InMemoryOrderLinks;
	LIST_ENTRY InInitializationOrderLinks;
	PVOID DllBase;
	PVOID EntryPoint;
	UINT32 SizeOfImage;
	_UNICODE_STRING  FullDllName;
	_UNICODE_STRING  BaseDllName;
	UCHAR FlagGroup;
	UINT32  Flags;
	UINT32 bitIDK;
	UINT16 ObsoleteLoadCount;
	UINT16 TlsIndex;
	_LIST_ENTRY HashLinks;
	UINT32 TimeDateStamp;

} LDR_DATA_TABLE_ENTRY, * PLDR_DATA_TABLE_ENTRY;//  bad thing - it is dependent on the version of windows we are using in theory ...

typedef struct _SYSTEM_PROCESS_INFO_L {
	ULONG                   NextEntryOffset;
	ULONG                   NumberOfThreads;
	LARGE_INTEGER           Reserved[3];
	LARGE_INTEGER           CreateTime;
	LARGE_INTEGER           UserTime;
	LARGE_INTEGER           KernelTime;
	UNICODE_STRING          ImageName;
	ULONG                   BasePriority;
	HANDLE                  ProcessId;
	HANDLE                  InheritedFromProcessId;
}_SYSTEM_PROCESS_INFO_L, * P_SYSTEM_PROCESS_INFO_L; //  bad thing - it is dependent on the version of windows we are using in theory ...

typedef struct _RTL_PROCESS_MODULE_INFORMATION {
	HANDLE Section;
	PVOID MappedBase;
	PVOID ImageBase;
	ULONG ImageSize;
	ULONG Flags;
	USHORT LoadOrderIndex;
	USHORT InitOrderIndex;
	USHORT LoadCount;
	USHORT OffsetToFileName;
	CHAR  FullPathName[MAXIMUM_FILENAME_LENGTH];
} RTL_PROCESS_MODULE_INFORMATION, * PRTL_PROCESS_MODULE_INFORMATION;

typedef struct _RTL_PROCESS_MODULES {
	ULONG NumberOfModules;
	RTL_PROCESS_MODULE_INFORMATION Modules[1];
} RTL_PROCESS_MODULES, * PRTL_PROCESS_MODULES;

typedef struct _PEB_LDR_DATA
{
	ULONG Length;
	UCHAR Initialized;                                                      //0x4
	PVOID SsHandle;                                                         //0x8
	LIST_ENTRY InLoadOrderModuleList;                               //0x10
	LIST_ENTRY InMemoryOrderModuleList;                             //0x20
	LIST_ENTRY InInitializationOrderModuleList;                     //0x30
	PVOID EntryInProgress;                                                  //0x40
	UCHAR ShutdownInProgress;                                               //0x48
	PVOID ShutdownThreadId;                                                 //0x50
} PEB_LDR_DATA, * PPEB_LDR_DATA;

typedef struct _RTL_USER_PROCESS_PARAMETERS {
	BYTE           Reserved1[16];
	PVOID          Reserved2[10];
	UNICODE_STRING ImagePathName;
	UNICODE_STRING CommandLine;
} RTL_USER_PROCESS_PARAMETERS, * PRTL_USER_PROCESS_PARAMETERS;

typedef struct _REAL_PEB {
	BYTE Reserved1[2];
	BYTE BeingDebugged;
	BYTE Reserved2[21];
	PPEB_LDR_DATA LoaderData;
	PRTL_USER_PROCESS_PARAMETERS ProcessParameters;
	BYTE Reserved3[520];
	PVOID PostProcessInitRoutine;
	BYTE Reserved4[136];
	ULONG SessionId;
} REALPEB, * PREALPEB;

typedef struct _SSDTTable
{
	PUINT32  system_service_descriptor_table;

} *PSSDTTable;



typedef struct _ARGB {
	UCHAR A;
	UCHAR R;
	UCHAR G;
	UCHAR B;
}ARGB, * PARGB;



typedef struct _Rectangle {


}Rectangle, * PRectangle;


typedef struct _BSODData {



}BSODData, * PBSODData;



